DeltaNova/STM32/WS2812/ws2812.cpp
void CylonBounce(uint8_t R, uint8_t G, uint8_t B, int EyeSize, int SpeedDelay, int ReturnDelay);
void Strobe(uint8_t R, uint8_t G, uint8_t B, uint8_t StrobeCount, uint16_t FlashDelay, uint16_t EndPause);
void Twinkle(uint8_t R, uint8_t G, uint8_t B, uint8_t Count, uint8_t SpeedDelay, bool OnlyOne);
void TwinkleRandom(uint8_t Count, uint8_t SpeedDelay, bool OnlyOne);
void theaterChase(uint8_t R, uint8_t G, uint8_t B, uint8_t SpeedDelay);

void meteorRain(uint8_t R, uint8_t G, uint8_t B, uint8_t meteorSize, uint8_t meteorTrailDecay, bool meteorRandomDecay, int SpeedDelay);
void fadeToBlack(int ledNo, uint8_t fadeValue);

void theaterChaseRainbow(int SpeedDelay);
uint8_t* Wheel(uint8_t WheelPos);

void setPixelHeatColor (uint8_t Pixel, uint8_t temperature);
void Fire(int Cooling, int Sparking, int SpeedDelay);
void ChristmasLightsStart();
void ChristmasLights();
*/
// Main - Called by the startup code.
int main(void) {
    ClockSetup();       // Setup System & Peripheral Clocks
    SysTick_Init();     // Enable SysTick
    PC13_LED_Setup();   // Setup PC13 for output LED
    DMA_Setup();
    PWM_Setup();

    // The counter will count to the reload value where upon it will toggle the
    // output state of each channel back to its reset value. 
    // During the count, before the reload value is reached, the count is 
    // compared with each channels compare value. If the compare value is
    // matched the output state of the matched channel will be toggled.
    
    // Timer 2 Channel 1 Compare Value
    //TIM2->CCR1 = 0x000F;        // 15 (Logic 1)
    TIM2->CCR1 = 0x0000; 
    // Timer 2 Channel 2 Compare Value
    TIM2->CCR2 = 0x0009;        // 9 (Logic 0)
    //delay_ms(2000);
    //ChristmasLightsStart();
    while(1){
        // Triggers Every Second
        toggleLed();    // Toggle LED (PC13)  to indicate loop operational
        
        // Triggers Every 6 Seconds
        //changeColour(); // Change the colours of the WS2812B LEDS
        
        /* Not Working as expected with more than 5 LEDS
        // Green with single reg strobe. Delay added to slow update rate
        writeLED(colour3, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour4, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour5, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour6, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour7, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour8, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour9, 5, DMA_Buffer);
        delay_ms(1000);
        */
        
        
        //setAllRGB(0,0,0,pixels);
        
        //setPixel(RED2,0,pixels);
        //setPixelRGB(0,0,63,1,pixels);
        //setPixelRGB(255,20,147,2,pixels);
        //writeLED(pixels,NUM_LEDS, DMA_Buffer);
        //delay_ms(1000);
        /*
        setAllRGB(138,43,226, pixels);
        writeLED(pixels,NUM_LEDS, DMA_Buffer);
        delay_ms(1000);
        
        setAllRGB(255,255,255, pixels);
        writeLED(pixels,NUM_LEDS, DMA_Buffer);
        delay_ms(1000);
        
        setAllRGB(250,20,147, pixels);
        writeLED(pixels,NUM_LEDS, DMA_Buffer);
        delay_ms(4000);
        
        setAll(RED2, pixels);
        writeLED(pixels,NUM_LEDS, DMA_Buffer);
        delay_ms(1000);
        */
        RGBLoop(pixels, DMA_Buffer);
        RGBLoop(pixels2, DMA_Buffer);
        //Sparkle(255,255,255,pixels,3); // White Sparkle
        //Sparkle(getRandomNumber(0,255),getRandomNumber(0,255),getRandomNumber(0,255),pixels,3);
        //CylonBounce(255,0,0,4,10,50);
        //Strobe(255,0x77,0,10,100,1000); //Slow
        //Strobe(255,255,255,10,50,1000); //Fast
        //Twinkle(255,0,0,10,100,false);
        //TwinkleRandom(20,100,false);
        //SnowSparkle(0x10, 0x10, 0x10, 20, getRandomNumber(100,1000));
        //RunningLights(255,255,0,50);  //Yellow
        //RunningLights(255,0,0,50); //RED
        //RunningLights(255,255,255,pixels,50);//WHITE
        //RunningLights(0,0,255,50); //BLUE
        //colorWipe(0x00,0xff,0x00, pixels, 50);
        //colorWipe(0x00,0x00,0x00, pixels, 50);
        //theaterChase(0xff,0,0,50);
        //Fire(55,120,15);
       //ChristmasLights();
       //theaterChaseRainbow(2); 
       //meteorRain(0xad,0x33,0xff,10, 64, true, 30);
    }
}
/*
 void ChristmasLightsStart(){
     // My Chrsitmas Light Display
        setAllRGB(0,0,0,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(25,0,0,0,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(25,0,0,1,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,2,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,3,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,4,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,5,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,6,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(50,0,0,4,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(50,0,0,2,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(50,0,0,3,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(128,0,0,2,pixels);
        setPixelRGB(128,0,0,3,pixels);
        setPixelRGB(128,0,0,4,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        uint8_t i;
        for (i=0; i < 10; i++){
            CylonBounce(255,0,0,4,10,50);
        }
}


void ChristmasLights(){
    uint8_t i;
    for (i=0; i < 6; i++){
        CylonBounce(255,255,255,4,10,50);
    }
    colorWipe(0x10,0x10,0x10,pixels,40);
    counter = 30000;
    while(counter){
        SnowSparkle(0x10, 0x10, 0x10, pixels, 20, getRandomNumber(100,1000));
    }
    
    Strobe(255,255,255,10,50,1000); //Fast
    
